var data1 = [{
        question: '我们要增强政治定力，增强道路自信、理论自信、制度自信。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '坚持中国特色社会主义道路自信、理论自信、制度自信、文化自信中，更基础、更广泛、更深厚的自信是文化自信。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '坚持中国特色社会主义的“四个自信”是指道路自信、理论自信、制度自信、文化自信。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '我们说坚定制度自信，是因为我们的制度完美，已经是成熟定型的制度。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '“三个自信”包括道路自信、理论自信、文化自信。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '“三个自信”是指不断增强中国特色社会主义的道路自信、理论自信和制度自信',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '习近平总书记在庆祝中国共产党成立95周年大会上明确提出坚定中国特色社会主义的“四个自信”。这“四个自信”是指道路自信、理论自信、制度自信、文化自信。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '我们说坚定制度自信，不是要固步自封，而是要不断革除体制机制弊端，让我们的制度成熟而持久。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '我们要增强政治定力，增强道路自信、理论自信、制度自信。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '道路自信是一个国家、一个民族发展中更基本、更深沉、更持久的力量。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },

    {
        question: '坚持“四个自信”，就是对中华民族古老文化理想的继承与自信。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },

    {
        question: '纸质口罩不适合预防新型冠状病毒使用',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：戴口罩是阻断呼吸道分泌物传播的有效手段。市民日常防护选择医用外科口罩和普通医用口罩就好。医用防护口罩（N95）的防病效果更好，过滤效果达到95%']
    },

    {
        question: '口罩越厚，防病效果越好',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：口罩不是越厚，防病毒效果就越好。医用外科口罩摸上去比较薄，但过滤效率却很高。而棉布口罩虽然厚实，但基本上不具备预防传染病的作用。只要是正规的医用口罩，戴一层就够了']
    },

    {
        question: '口罩可以随时用完随时丢',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：废弃口罩的正确丢弃姿势：无发热、咳嗽等症状的普通民众，因风险较低，使用过的口罩可毁坏后丢入“有害垃圾”桶；存在发热、咳嗽、咳痰、打喷嚏等症状的民众，用开水（或56℃以上的热水）浸泡30分钟或用酒精喷雾消毒后密封丢弃到“有害垃圾”桶内；处理完废弃口罩后要及时洗手哦']
    },

    {
        question: '在家中预防新型冠状病毒，可将白醋放在暖气片上，消毒室内空气',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：食醋中的主要成分是乙酸，一般在食醋中的比例是6%-8%左右。可以用来蒸熏，进行空气消毒的是过氧乙酸，而乙酸并没有这个作用']
    },

    {
        question: '在旅途中时，用过的口罩，要放入包里或兜里',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：用过的口罩，不要直接放入包里或兜里，以免造成持续污染。正确的做法是：将口罩由内向外折叠后，装进塑料垃圾袋或保鲜袋封口']
    },

    {
        question: '淡盐水漱口有利于预防新冠病毒',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：新冠病毒侵犯的部位在呼吸道，盐水漱口没办法清洁呼吸道']
    },

    {
        question: '接触疑似传染新型冠状病毒肺炎的人员和临床诊断病人的医务人员，脱离隔离区后需进行14天的医学观察',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: ['解析：新型冠状病毒肺炎的潜伏期平均在7天左右，短的在2~3天，长的10~12天。参考其他冠状病毒所致疾病潜伏期，此次新冠病毒病例相关信息和防控实际，将密切接触者医学观察期定为14天，并对密切接触者进行居家医学观察']
    },

];

var data2 = [{
        question: '刘云山8月5日在北戴河看望暑期休假专家，提出实施创新驱动发展战略，既需要科技创新的支撑，也需要（）的引领。坚定道路自信、理论自信、制度自信，保持文化自信和价值观自信。',
        type: 'radio',
        options: [
            '理论创新',
            '价值创新',
            '文化创新',
            '制度创新'
        ],
        result: ['C'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '《党的十九大报告进一步明确中国特色社会主义事业总体布局是（）、战略布局是“四个全面”，强调坚定道路自信、理论自信、制度自信、文化自信.',
        type: 'radio',
        options: [
            '三位一体',
            '四位一体',
            '五位一体',
            '一体化'
        ],
        result: ['C'],
        explain: ['解析：本题暂无解析']
    },
    {
        question: '要在深入把握中国特色社会主义（）的基础上，坚定道路自信、理论自信、制度自信，不断开创中国特色社会主义事业新局面。',
        type: 'radio',
        options: [
            '科学性和真理性',
            '客观性和全面性',
            '系统性和协调性',
            '主观性和真理性'
        ],
        result: ['A'],
        explain: ['党的十八大报告']
    },

    {
        question: '十八大报告指出，全党要坚定（）自信、（）自信、（）自信。',
        type: 'radio',
        options: [
            '理论、道路、制度',
            '道路、理论、制度',
            '领导、道路、制度',
            '思想、道路、理论'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },
    {
        question: ' 实现“中国梦”必须坚定“三个自信”，具体是指道路自信、理论自信和（）。',
        type: 'radio',
        options: [
            '路线自信',
            '改革自信',
            '制度自信',
            '文化自信'
        ],
        result: ['C'],
        explain: ['解析：本题暂无解析']
    },

    {
        question: '党和国家引导青年学生不断增强道路自信，理论自信和（）自信。',
        type: 'radio',
        options: [
            '制度',
            '行动',
            '思想 ',
            '品德'
        ],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },

    {
        question: '没有坚定的制度自信就不可能有全面深化改革的勇气，同样，离开（），制度自信也不可能彻底，不可能久远。',
        type: 'radio',
        options: [
            '改革',
            '不断改革',
            '勇气',
            '文化'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '习近平参观“英雄史诗不朽丰碑”（）主题展。他强调，引导广大干部群众坚定中国特色社会主义道路自信、理论自信、制度自信、文化自信，实现“两个一百年”奋斗目标、实现中华民族伟大复兴中国梦。',
        type: 'radio',
        options: [
            '抗战胜利80周年',
            '长征胜利80周年',
            '解放胜利70周年',
            '抗美援朝胜利60周年'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '习近平在学习《胡锦涛文选》报告会上的讲话指出：坚定中国特色社会主义道路自信、理论自信、制度自信、文化自信，不断夺取中国特色社会主义新胜利，是当代中国共产党人（）。',
        type: 'radio',
        options: [
            '最主要的使命',
            '最基本的使命',
            '最重要的使命',
            '最核心的使命'
        ],
        result: ['D'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '关于建设中国特色社会主义，十八大提出了理论自信、道路自信和（）“三个自信”。',
        type: 'radio',
        options: [
            '制度自信',
            '民主自信',
            '法制自信',
            '道德自信'
        ],
        result: ['A'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '习近平7月21日参观（）主题展览。他强调，传承红色基因，坚定道路自信、理论自信、制度自信、文化自信，为把人民军队建设成为世界一流军队而不懈奋斗。',
        type: 'radio',
        options: [
            '建党90周年',
            '建军80周年',
            '建军90周年',
            '建国70周年'
        ],
        result: ['C'],
        explain: ['解析：本题暂无解析']
    },





    {
        question: '关于树立高度的文化自觉和文化自信，以下说法有误的是（）。',
        type: 'radio',
        options: [
            '加强社会主义核心价值体系建设',
            '全面提高公民道德素质',
            '丰富人民物质文化生活',
            '增强文化整体实力和竞争力'
        ],
        result: ['C'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '著名作家王蒙认为，文化自觉与文化自信包含着对于长期积淀下来的优秀民族传统的熟悉与热爱，也包含着对于传统文化的创造性弘扬发展，将传统引导到现代。从文化上看，这一观点主要强调了（）①文化自觉和文化自信必须立足于对本民族优秀传统文化的尊重②文化自觉和文化自信必须包容和借鉴异域民族文化的优秀成果③只有继承发展和创新本民族优秀传统文化才能树立文化自觉和文化自信④树立本民族文化自觉和文化自信是支撑中华民族生存、发展的精神支柱',
        type: 'radio',
        options: [
            '①②',
            '①③',
            '②④',
            '③④'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '习近平在赠书上写到：要通过传承优秀传统文化增强民族文化自信，弘扬（），做到（）、知行合一。',
        type: 'radio',
        options: [
            '社会主义核心价值观；格物致知',
            '爱国主义精神；明德笃行',
            '社会主义核心价值观；明德笃行',
            '爱国主义精神；格物致知'
        ],
        result: ['D'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '以组织文化作为组织的精神目标和支柱，激励全体成员自信、自强，团结进取。这体现了组织文化的（）。',
        type: 'radio',
        options: [
            '目标导向功能',
            '激励功能',
            '创新功能',
            '凝聚功能'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '语言的背后是文化，而文化的背后是实力，英语在世界范围内的盛行是英美体系获胜的结果。虽然中国经济快速发展，但软实力不够，语言文化的发展落后于经济的发展，自信心不足，故而才有对英语的崇拜；对英语的崇拜，实际上是对本民族文化不自信的体现。这段文字意在说明（）。',
        type: 'radio',
        options: [
            '应加快文化的发展步伐，使其与经济的快速发展同步',
            '应破除对英语的盲目崇拜，树立对本民族文化的自信心',
            '目前对英语的重视程度是不正常的，应该引起人们的反思',
            '语言是民族文化的重要部分，必须重视对本国语言的保护'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },

    {
        question: '文化自信是对实现（）的坚定把握和推动构建人类命运共同体的正心诚意。',
        type: 'radio',
        options: [
            '全面建成小康社会',
            '中华民族伟大复兴中国梦',
            '三步走战略',
            '两个一百年目标'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },




    {
        question: '“文化自信，是一个国家，一个民族，一个政党对自身文化价值的充分肯定，对自身文化生命力的坚定信念。”增强文化自信要（）①坚持文化“走出去”战略②对本民族文化有自信心和自豪感③包容、借鉴、吸收外来优秀文化，坚持以我为主，为我所用④克服“守旧主义”和“封闭主义”、“民族虚无主义”和“历史虚无主义”等错误倾向',
        type: 'radio',
        options: [
            '①',
            '①②',
            '①②③',
            '①②③④'
        ],
        result: ['D'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '为进一步弘扬中华优秀传统文化，增强文化自信，促进戏曲传承发展，中宣部、教育部、财政部、文化部日前出台《关于（）的实施意见》。',
        type: 'radio',
        options: [
            '杂技进校园',
            '戏曲进校园',
            '演唱会进校园',
            '微电影进校园'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '（）建设10年来，在增强农民文化自信、保障农民基本文化权益、加强农村公共文化服务体系和农村精神文明建设等方面作出了重要贡献。',
        type: 'radio',
        options: [
            '农村戏台',
            '农家书屋',
            '农村淘宝',
            '农村私塾'
        ],
        result: ['B'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '公民个人对自己能够影响政府活动的自尊、自信和自我实现的政治倾向叫（）',
        type: 'radio',
        options: [
            '利益的估量',
            '结局的满意度',
            '政治选择的判断',
            '政治效能感'
        ],
        result: ['D'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '截止目前，世界卫生组织（WHO）对新型冠状病毒的命名是什么？',
        type: 'radio',
        options: [
            'SARS-CoV',
            'MERS-CoV',
            'COVID-19',
            'SARI'
        ],
        result: ['C'],
        explain: ['解析：新型冠状病毒是指以前从未在人类中发现的冠状病毒新毒株。世界卫生组织在2020年2月11日宣布，将新型冠状病毒命名为“COVID-19”']
    },

    {
        question: '针对新型冠状病毒，以下哪种条件可以杀灭病毒？',
        type: 'radio',
        options: [
            '在56℃，30分钟条件下',
            '在26℃，20分钟条件下',
            '在16℃，10分钟条件下',
            '在0℃，5分钟条件下'
        ],
        result: ['A'],
        explain: ['解析：新型冠状病毒对热敏感，在56℃条件下，30分钟就能杀灭病毒。利用含氯消毒剂、酒精、碘类、过氧化物类等多种消毒剂也可以杀灭该病毒。']
    },

    {
        question: '下面哪种动物不是冠状病毒常见的宿主？',
        type: 'radio',
        options: [
            '果子狸',
            '蝙蝠',
            '竹鼠',
            '蚊子'
        ],
        result: ['D'],
        explain: ['解析：很多野生动物都可能携带病原体，成为某些传染病的传播媒介，果子狸、蝙蝠、竹鼠、獾是冠状病毒的常见宿主。不要吃未经检疫的野生动物、生鲜等食品，比如路边摊售卖的肉食，不要为了“尝鲜”而冒险']
    },

    {
        question: '已知的新型冠状病毒的传播途径中不包括以下哪种？',
        type: 'radio',
        options: [
            '接触传播',
            '飞沫传播',
            '土壤传播',
            '血液传播'
        ],
        result: ['C'],
        explain: ['解析：<<新型冠状病毒感染的肺炎诊疗方案（试行）>>中说明，经呼吸道飞沫和接触传播是主要的传播途径。气溶胶和消化道等传播途径尚待明确。']
    },


    {
        question: '关于飞沫传播，以下说法不正确的是？',
        type: 'radio',
        options: [
            '可以通过一定距离进入易感的黏膜表面',
            '颗粒较大，不会长时间悬浮在空气中',
            '说话、咳嗽、打喷嚏都可能造成飞沫',
            '医用类口罩不能阻止飞沫传播'
        ],
        result: ['D'],
        explain: ['解析：飞沫通常是由咳嗽、打喷嚏、说话产生的。飞沫可以通过一定的距离（一般为1米）进入易感的黏膜表面，且颗粒较大，不会长期悬浮在空气中。选择正确的医用类口罩可以有效隔绝飞沫的传播']
    },


    {
        question: '关于咳嗽和打喷嚏时的注意事项，以下说法不正确的是？',
        type: 'radio',
        options: [
            '打喷嚏时应用纸巾或胳膊肘遮掩口鼻',
            '咳嗽和打喷嚏时应用双手遮掩口鼻',
            '把打喷嚏用过的纸巾放入有盖垃圾桶',
            '打喷嚏和咳嗽后最好彻底清洁双手'
        ],
        result: ['B'],
        explain: ['解析：咳嗽或打喷嚏时应当用纸巾或胳膊肘遮挡口鼻，不要用双手遮挡，以免将病毒残留在双手上，导致将病毒传播到他处']
    },


];

var data3 = [{
        question: '要坚定中国特色社会主义的“道路自信、理论自信、制度自信”，就是要（）。',
        type: 'multi',
        options: [
            '坚定对中国特色社会主义建设伟大事业实现途径、行动指南、根本保障的自信',
            '坚定不移高举中国特色社会主义伟大旗帜',
            '既不走封闭僵化的老路，也不走改旗易帜的邪路',
            '坚持和拓展中国特色社会主义道路，坚持和丰富中国特色社会主义理论体系，坚持和完善中国特色社会主义制度'
        ],
        result: ['A','B','C','D'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '坚定中国特色社会主义制度自信，首先要（）。',
        type: 'multi',
        options: [
            '坚定对中国特色社会主义政治制度的自信',
            '增强走中国特色社会主义政治发展道路的信心和决心',
            '必须全面推进依法治国',
            '必须坚持民主集中制'
        ],
        result: ['A', 'B'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '文化自信，就是要对中华文化充满自信。中华文化自信的底气在于（） ',
        type: 'multi',
        options: [
            '中华文化既是民族的又是世界的',
            '中华文化源远流长、博大精深',
            '中华文化比其他民族文化更优越',
            '中国特色社会主义先进文化具有强大生命力'
        ],
        result: ['B', 'D'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '党的十八报告指出：“在全面建设小康社会进程中推进（）、（）、（），强调坚持以人为本、全面协调可持续发展。”可以说，报告首次将制度创新与制度自信提到了前所未有的高度，是我党新的历史时期的制度自觉和制度自信的突出表现。',
        type: 'multi',
        options: [
            '实践创新',
            '理论创新',
            '制度创新',
            '文化创新'
        ],
        result: ['A', 'B', 'C'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '中国共产党第十八届中央委员会第六次全体会议提出。全党同志必须把（）作为毕生追求，坚定对中国特色社会主义的道路自信、理论自信、制度自信、文化自信。',
        type: 'multi',
        options: [
            '对马克思主义的信仰',
            '对对社会主义和共产主义的信念',
            '对毛泽东思想的信仰',
            '对中国特色社会主义的信念'
        ],
        result: ['A', 'B'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '中国走和平发展道路的自信和自觉，来源于（）。',
        type: 'multi',
        options: [
            '中华文明的深厚渊源',
            '对实现中国发展目标条件的认知',
            '对世界发展大势的把握',
            '对殖民主义、霸权主义的判断'
        ],
        result: ['A', 'B', 'C'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '文化自信标示了中国道路的历史连续性，体现在（）。',
        type: 'multi',
        options: [
            '是在改革开放30多年的伟大实践中走出来的',
            '是在中华人民共和国成立60多年的持续探索中走出来的',
            '是在对近代以来170多年中华民族发展历程的深刻总结中走出来的',
            '是在对中华民族5000多年悠久文明的传承中走出来的'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: ['解析：本题暂无解析']
    },

    {
        question: '习近平总书记指出，共青团要努力帮助广大青年树立远大理想，坚定走中国特色社会主义道路的人生信念，（），使他们不断增强道路自信、理论自信、制度自信，不断增进对党的信赖、信念、信心。',
        type: 'multi',
        options: [
            '用科学的理论武装青年',
            '用历史的眼光启示青年',
            '用伟大的目标感召青年',
            '用光明的未来激励青年'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: ['解析：本题暂无解析']
    },



    {
        question: '传承和弘扬传统文化的思想精华，要讲清楚中华优秀传统文化的（），增强文化自信和价值观自信。',
        type: 'multi',
        options: [
            '历史渊源、发展脉络',
            '基本走向',
            '独特创造、价值理念',
            '鲜明特色'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: ['解析：本题暂无解析']
    },




    {
        question: '坚定文化自信，推动社会主义文化繁荣兴盛必须要做到（）。',
        type: 'multi',
        options: [
            '牢牢掌握意识形态工作领导权',
            '用新时代中国特色社会主义思想武装全党',
            '培育和践行社会主义核心价值观',
            '加强思想道德建设'
        ],
        result: ['A', 'C', 'D'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '文化自信是“中国特色”更基本、更深沉、更持久的力量，体现在（）。',
        type: 'multi',
        options: [
            '文化自信标示“中国特色”的文化坐标',
            '文化自信揭示“中国特色”的文化本质',
            '文化自信阐释“中国特色”的文化权利',
            '文化自信昭示“中国特色”的世界意义'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: ['解析：本题暂无解析']
    },


    {
        question: '文化是一个国家、一个民族的灵魂。文化兴国运兴，文化强民族强。没有高度的文化自信，没有文化的繁荣兴盛，就没有中华民族伟大复兴。就要坚持（）。',
        type: 'multi',
        options: [
            '中国特色社会主义文化发展道路',
            '激发全民族文化创新创造活力',
            '建设社会主义文化强国',
            '中国共产党的领导'
        ],
        result: ['A', 'B', 'C'],
        explain: ['解析：本题暂无解析']
    },


];


var data = [];

data = data.concat(data1);
data = data.concat(data2);
data = data.concat(data3);